yenchouRJ/nuc990_non-os/Library/Device/Nuvoton/NUC990/Include/nuc990.h
/**************************************************************************//**
 * @file     nuc990.h
 * @brief    NUC990 peripheral access layer header file.
 *           This file contains all the peripheral register's definitions
 *           and memory mapping for NuMicro NUC990 MPU.
 *
 * SPDX-License-Identifier: Apache-2.0
 * @copyright (C) 2025 Nuvoton Technology Corp. All rights reserved.
 *****************************************************************************/
/**
   \mainpage NuMicro NUC990 Family Driver Reference Guide
   *
   * <b>Introduction</b>
   *
   * This user manual describes the usage of NUC990 family device driver
   *
   * <b>Disclaimer</b>
   *
   * The Software is furnished "AS IS", without warranty as to performance or results, and
   * the entire risk as to performance or results is assumed by YOU. Nuvoton disclaims all
   * warranties, express, implied or otherwise, with regard to the Software, its use, or
   * operation, including without limitation any and all warranties of merchantability, fitness
   * for a particular purpose, and non-infringement of intellectual property rights.
   *
   * <b>Important Notice</b>
   *
   * Nuvoton Products are neither intended nor warranted for usage in systems or equipment,
   * any malfunction or failure of which may cause loss of human life, bodily injury or severe
   * property damage. Such applications are deemed, "Insecure Usage".
   *
   * Insecure usage includes, but is not limited to: equipment for surgical implementation,
   * atomic energy control instruments, airplane or spaceship instruments, the control or
   * operation of dynamic, brake or safety systems designed for vehicular use, traffic signal
   * instruments, all types of safety devices, and other applications intended to support or
   * sustain life.
   *
   * All Insecure Usage shall be made at customer's risk, and in the event that third parties
   * lay claims to Nuvoton as a result of customer's Insecure Usage, customer shall indemnify
   * the damages and liabilities thus incurred by Nuvoton.
   *
   * Please note that all data and specifications are subject to change without notice. All the
   * trademarks of products and companies mentioned in this document belong to their respective
   * owners.
   *
   * <b>Copyright Notice</b>
   *
   * Copyright (C) 2025 Nuvoton Technology Corp. All rights reserved.
   */

#ifndef __NUC990_H__
#define __NUC990_H__

#include <stdint.h>

#ifdef __cplusplus
extern "C" {
#endif

/**
 * @details  Interrupt Number Definition.
 */
typedef enum IRQn
{
    WDT_IRQn             = 1,      /*! Watchdog Timer Interrupt           */
    WWDT_IRQn            = 2,      /*! Windowed WDT Interrupt             */
    LVD_IRQn             = 3,      /*! Low Voltage Detect Interrupt       */
    EXTI0_IRQn           = 4,      /*! External Interrupt 0               */
    EXTI1_IRQn           = 5,      /*! External Interrupt 1               */
    EXTI2_IRQn           = 6,      /*! External Interrupt 2               */
    EXTI3_IRQn           = 7,      /*! External Interrupt 3               */
    GPA_IRQn             = 8,      /*! GPIO A Interrupt                   */
    GPB_IRQn             = 9,      /*! GPIO B Interrupt                   */
    GPC_IRQn             = 10,     /*! GPIO C Interrupt                   */
    GPD_IRQn             = 11,     /*! GPIO D Interrupt                   */
    GPE_IRQn             = 12,     /*! GPIO E Interrupt                   */
    GPF_IRQn             = 13,     /*! GPIO F Interrupt                   */
    GPG_IRQn             = 14,     /*! GPIO G Interrupt                   */
    GPH_IRQn             = 15,     /*! GPIO H Interrupt                   */
    I2S_IRQn             = 16,     /*! I2S Interrupt                      */
    RTC_IRQn             = 17,     /*! RTC Interrupt                      */
    TIMER0_IRQn          = 18,     /*! Timer 0 interrupt                  */
    TIMER1_IRQn          = 19,     /*! Timer 1 interrupt                  */
    TIMER2_IRQn          = 20,     /*! Timer 2 interrupt                  */
    TIMER3_IRQn          = 21,     /*! Timer 3 interrupt                  */
    TIMER4_IRQn          = 22,     /*! Timer 4 interrupt                  */
    TIMER5_IRQn          = 23,     /*! Timer 5 interrupt                  */
    I2C0_IRQn            = 24,     /*! I2C 0 interrupt                    */
    I2C1_IRQn            = 25,     /*! I2C 1 interrupt                    */
    I2C2_IRQn            = 26,     /*! I2C 2 interrupt                    */
    I2C3_IRQn            = 27,     /*! I2C 3 interrupt                    */
    SMC0_IRQn            = 28,     /*! Smart Card 0 interrupt             */
    SMC1_IRQn            = 29,     /*! Smart Card 1 interrupt             */
    BPWM0_IRQn           = 30,     /*! BPWM0 interrupt                    */
    BPWM1_IRQn           = 31,     /*! BPWM1 interrupt                    */
    UART0_IRQn           = 32,     /*! UART 0 interrupt                   */
    UART1_IRQn           = 33,     /*! UART 1 interrupt                   */
    UART2_IRQn           = 34,     /*! UART 2 interrupt                   */
    UART3_IRQn           = 35,     /*! UART 3 interrupt                   */
    UART4_IRQn           = 36,     /*! UART 4 interrupt                   */
    UART5_IRQn           = 37,     /*! UART 5 interrupt                   */
    UART6_IRQn           = 38,     /*! UART 6 interrupt                   */
    UART7_IRQn           = 39,     /*! UART 7 interrupt                   */
    UART8_IRQn           = 40,     /*! UART 8 interrupt                   */
    UART9_IRQn           = 41,     /*! UART 9 interrupt                   */
    ADC_IRQn             = 42,     /*! ADC interrupt                      */
    EADC00_IRQn          = 43,     /*! EADC interrupt 0                   */
    EADC01_IRQn          = 44,     /*! EADC interrupt 1                   */
    EADC02_IRQn          = 45,     /*! EADC interrupt 2                   */
    EADC03_IRQn          = 46,     /*! EADC interrupt 3                   */
    QSPI0_IRQn           = 47,     /*! QSPI 0 interrupt                   */
    SPI0_IRQn            = 48,     /*! SPI 0 interrupt                    */
    SPI1_IRQn            = 49,     /*! SPI 1 interrupt                    */
    SPI2_IRQn            = 50,     /*! SPI 2 interrupt                    */
    SPI3_IRQn            = 51,     /*! SPI 3 interrupt                    */
    PDMA0_IRQn           = 52,     /*! PDMA Channel Interrupt             */
    PDMA1_IRQn           = 53,     /*! PDMA Channel Interrupt             */
    EHCI_IRQn            = 54,     /*! USB 2.0 Host Controller Interrupt  */
    OHCI_IRQn            = 55,     /*! USB 1.1 Host Controller Interrupt  */
    UDC_IRQn             = 56,     /*! USB Device Controller Interrupt    */
    SDH0_IRQn            = 57,     /*! SD/SDIO Host 0 Interrupt           */
    SDH1_IRQn            = 58,     /*! SD/SDIO Host 1 Interrupt           */
    NAND_IRQn            = 59,     /*! NAND Flash Controller Interrupt    */
    EMAC0_RX_IRQn        = 60,     /*! EMAC 0 RX Interrupt                */
    EMAC0_TX_IRQn        = 61,     /*! EMAC 0 TX Interrupt                */
    EMAC1_RX_IRQn        = 62,     /*! EMAC 1 RX Interrupt                */
    EMAC1_TX_IRQn        = 63,     /*! EMAC 1 TX Interrupt                */
    CAN0_IRQn            = 64,     /*! CAN 0 Interrupt                    */
    CAN1_IRQn            = 65,     /*! CAN 1 Interrupt                    */
    CAN2_IRQn            = 66,     /*! CAN 2 Interrupt                    */
    CAN3_IRQn            = 67,     /*! CAN 3 Interrupt                    */
    CANFD00_IRQn         = 72,     /*! CAN FD 0 Interrupt 0               */
    CANFD01_IRQn         = 73,     /*! CAN FD 0 Interrupt 1               */
    CANFD10_IRQn         = 74,     /*! CAN FD 1 Interrupt 0               */
    CANFD11_IRQn         = 75,     /*! CAN FD 1 Interrupt 1               */
    CANFD20_IRQn         = 76,     /*! CAN FD 2 Interrupt 0               */
    CANFD21_IRQn         = 77,     /*! CAN FD 2 Interrupt 1               */
    CANFD30_IRQn         = 78,     /*! CAN FD 3 Interrupt 0               */
    CANFD31_IRQn         = 79,     /*! CAN FD 3 Interrupt 1               */
    CRYPTO_IRQn          = 80,     /*! CRYPTO Engine Interrupt            */
    KS_IRQn              = 81,     /*! Key Store Interrupt                */
} IRQn_Type;

#ifdef __cplusplus
#define __I     volatile           /*!< Defines 'read only' permissions   */
#else
#define __I     volatile const     /*!< Defines 'read only' permissions   */
#endif
#define __O     volatile           /*!< Defines 'write only' permissions  */
#define __IO    volatile           /*!< Defines 'read/write' permissions  */

/**************************************************************************/
/*                        Register definitions                            */
/**************************************************************************/
#include "adc_reg.h"
#include "aic_reg.h"
#include "bpwm_reg.h"
#include "can_reg.h"
#include "canfd_reg.h"
#include "clk_reg.h"
#include "crypto_reg.h"
#include "ebi_reg.h"
#include "emac_reg.h"
#include "gpio_reg.h"
#include "hsusbh_reg.h"
#include "i2c_reg.h"
#include "i2s_reg.h"
#include "keystore_reg.h"
#include "nfi_reg.h"
#include "otp_reg.h"
#include "pdma_reg.h"
#include "qspi_reg.h"
#include "rtc_reg.h"
#include "sc_reg.h"
#include "sdh_reg.h"
#include "sys_reg.h"
#include "timer_reg.h"
#include "uart_reg.h"
//#include "usbd_reg.h"
#include "usbh_reg.h"
#include "wdt_reg.h"
#include "wwdt_reg.h"

