yenchouRJ/nuc990_non-os/Library/Device/Nuvoton/NUC990/Include/nuc990.h
/** @addtogroup NUC990_PERIPHERAL_MEM_MAP Peripheral Memory Base
  Memory Mapped Structure for NUC990 Peripheral
  @{
 */

/*!< AHB peripherals */
#define SYS_BASE         0xB0000000
#define CLK_BASE         0xB0000200
#define SDIC_BASE        0xB0002000
#define GPIO_BASE        0xB0004000
#define GPIO_DBCTL_BASE  0xB0004440
#define PDMA0_BASE       0xB0008000
#define PDMA1_BASE       0xB0009000
#define EBI_BASE         0xB0010000
#define EMAC0_BASE       0xB0012000
#define EMAC1_BASE       0xB0022000
#define OTP_BASE         0xB0025000
#define HSUSBH_BASE      0xB0015000
#define USBD_BASE        0xB0016000
#define USBH_BASE        0xB0017000
#define SDH1_BASE        0xB0018000
#define NFI_BASE         0xB0019000
#define SDH0_BASE        0xB001A000
#define CRYPTO_BASE      0xB001C000
#define KEYSTORE_BASE    0xB001F000
#define I2S_BASE         0xB0020000

#define PA_BASE          0xB0004000
#define PB_BASE          0xB0004040
#define PC_BASE          0xB0004080
#define PD_BASE          0xB00040C0
#define PE_BASE          0xB0004100
#define PF_BASE          0xB0004140
#define PG_BASE          0xB0004180
#define PH_BASE          0xB00041C0

/*!< APB peripherals */

#define WDT_BASE         0xB0040000
#define WWDT_BASE        0xB0040100
#define RTC_BASE         0xB0041000
#define AIC_BASE         0xB0042000
#define ADC_BASE         0xB0043000
#define TIMER01_BASE     0xB0050000
#define TIMER0_BASE      0xB0050000
#define TIMER1_BASE      0xB0050100
#define TIMER23_BASE     0xB0051000
#define TIMER2_BASE      0xB0051000
#define TIMER3_BASE      0xB0051100
#define TIMER45_BASE     0xB0052000
#define TIMER4_BASE      0xB0052000
#define TIMER5_BASE      0xB0052100
#define PWM0_BASE        0xB0058000
#define PWM1_BASE        0xB0059000
#define BPWM0_BASE       0xB0058000
#define BPWM1_BASE       0xB0059000
#define QSPI0_BASE       0xB0060000
#define SPI0_BASE        0xB0061000
#define SPI1_BASE        0xB0062000
#define SPI2_BASE        0xB0063000
#define SPI3_BASE        0xB0064000
#define UART0_BASE       0xB0070000
#define UART1_BASE       0xB0071000
#define UART2_BASE       0xB0072000
#define UART3_BASE       0xB0073000
#define UART4_BASE       0xB0074000
#define UART5_BASE       0xB0075000
#define UART6_BASE       0xB0076000
#define UART7_BASE       0xB0077000
#define UART8_BASE       0xB0078000
#define UART9_BASE       0xB0079000
#define I2C0_BASE        0xB0080000
#define I2C1_BASE        0xB0081000
#define I2C2_BASE        0xB0082000
#define I2C3_BASE        0xB0083000
#define SC0_BASE         0xB0090000
#define SC1_BASE         0xB0091000
#define CAN0_BASE        0xB00A0000
#define CAN1_BASE        0xB00A1000
#define CAN2_BASE        0xB00A2000
#define CAN3_BASE        0xB00A3000
#define CAN4_BASE        0xB00A4000
#define CAN5_BASE        0xB00A5000
#define CAN6_BASE        0xB00A6000
#define CAN7_BASE        0xB00A7000
#define CANFD0_BASE      0xB0100000
#define CANFD1_BASE      0xB0110000
#define CANFD2_BASE      0xB0120000
#define CANFD3_BASE      0xB0130000

/*@}*/ /* end of group NUC990_PERIPHERAL_MEM_MAP */

/**************************************************************************/
/*                      Peripheral Declaration                            */
/**************************************************************************/

/** @addtogroup PERIPHERAL_DECLARATION Peripheral Pointer
  The Declaration of Peripheral Pointer
  @{
 */
#define SYS              ((SYS_T *)        SYS_BASE)
#define CLK              ((CLK_T *)        CLK_BASE)
#define SDIC             ((SDIC_T *)       SDIC_BASE)
#define GPIO             ((GPIO_DBCTL_T *) GPIO_DBCTL_BASE)
#define PDMA0            ((PDMA_T *)       PDMA0_BASE)
#define PDMA1            ((PDMA_T *)       PDMA1_BASE)
#define EBI              ((EBI_T *)        EBI_BASE)
#define EMAC0            ((EMAC_T *)       EMAC0_BASE)
#define EMAC1            ((EMAC_T *)       EMAC1_BASE)
#define USBD             ((USBD_T *)       USBD_BASE)
#define OTP              ((OTP_T *)        OTP_BASE)
#define USBH             ((USBH_T *)       USBH_BASE)
#define HSUSBH           ((HSUSBH_T *)     HSUSBH_BASE)
#define SDH0             ((SDH_T *)        SDH0_BASE)
#define SDH1             ((SDH_T *)        SDH1_BASE)
#define NFI              ((NFI_T *)        NFI_BASE)
#define CRYPTO           ((CRYPTO_T *)     CRYPTO_BASE)
#define I2S              ((I2S_T *)        I2S_BASE)
#define KS               ((KS_T *)         KEYSTORE_BASE)
#define PA               ((GPIO_T *)       PA_BASE)
#define PB               ((GPIO_T *)       PB_BASE)
#define PC               ((GPIO_T *)       PC_BASE)
#define PD               ((GPIO_T *)       PD_BASE)
#define PE               ((GPIO_T *)       PE_BASE)
#define PF               ((GPIO_T *)       PF_BASE)
#define PG               ((GPIO_T *)       PG_BASE)
#define PH               ((GPIO_T *)       PH_BASE)
#define GPIOA            ((GPIO_T *)       PA_BASE)
#define GPIOB            ((GPIO_T *)       PB_BASE)
#define GPIOC            ((GPIO_T *)       PC_BASE)
#define GPIOD            ((GPIO_T *)       PD_BASE)
#define GPIOE            ((GPIO_T *)       PE_BASE)
#define GPIOF            ((GPIO_T *)       PF_BASE)
#define GPIOG            ((GPIO_T *)       PG_BASE)
#define WDT              ((WDT_T *)        WDT_BASE)
#define WWDT             ((WWDT_T *)       WWDT_BASE)
#define RTC              ((RTC_T *)        RTC_BASE)
#define AIC              ((AIC_T *)        AIC_BASE)
#define ADC              ((ADC_T *)        ADC_BASE)
#define TIMER0           ((TIMER_T *)      TIMER0_BASE)
#define TIMER1           ((TIMER_T *)      TIMER1_BASE)
#define TIMER2           ((TIMER_T *)      TIMER2_BASE)
#define TIMER3           ((TIMER_T *)      TIMER3_BASE)
#define TIMER4           ((TIMER_T *)      TIMER4_BASE)
#define TIMER5           ((TIMER_T *)      TIMER5_BASE)
#define BPWM0            ((BPWM_T *)       BPWM0_BASE)
#define BPWM1            ((BPWM_T *)       BPWM1_BASE)
#define QSPI0            ((QSPI_T *)       QSPI0_BASE)
#define SPI0             ((SPI_T *)        SPI0_BASE)
#define SPI1             ((SPI_T *)        SPI1_BASE)
#define SPI2             ((SPI_T *)        SPI2_BASE)
#define SPI3             ((SPI_T *)        SPI3_BASE)
#define UART0            ((UART_T *)       UART0_BASE)
#define UART1            ((UART_T *)       UART1_BASE)
#define UART2            ((UART_T *)       UART2_BASE)
#define UART3            ((UART_T *)       UART3_BASE)
#define UART4            ((UART_T *)       UART4_BASE)
#define UART5            ((UART_T *)       UART5_BASE)
#define UART6            ((UART_T *)       UART6_BASE)
#define UART7            ((UART_T *)       UART7_BASE)
#define UART8            ((UART_T *)       UART8_BASE)
#define UART9            ((UART_T *)       UART9_BASE)
#define I2C0             ((I2C_T *)        I2C0_BASE)
#define I2C1             ((I2C_T *)        I2C1_BASE)
#define I2C2             ((I2C_T *)        I2C2_BASE)
#define I2C3             ((I2C_T *)        I2C3_BASE)
#define SC0              ((SC_T *)         SC0_BASE)
#define SC1              ((SC_T *)         SC1_BASE)
#define CAN0             ((CAN_T *)        CAN0_BASE)
#define CAN1             ((CAN_T *)        CAN1_BASE)
#define CAN2             ((CAN_T *)        CAN2_BASE)
#define CAN3             ((CAN_T *)        CAN3_BASE)
#define CANFD0           ((CANFD_T *)      CANFD0_BASE)
#define CANFD1           ((CANFD_T *)      CANFD1_BASE)
#define CANFD2           ((CANFD_T *)      CANFD2_BASE)
#define CANFD3           ((CANFD_T *)      CANFD3_BASE)

/*@}*/ /* end of group PERIPHERAL_DECLARATION */

/** @addtogroup IO_ROUTINE  I/O Routines
  The Declaration of NUC990 I/O Routines
  @{
 */

typedef volatile unsigned char  vu8;   /*!< Define 8-bit unsigned volatile data type    */
typedef volatile unsigned short vu16;  /*!< Define 16-bit unsigned volatile data type   */
typedef volatile unsigned long  vu32;  /*!< Define 32-bit unsigned volatile data type   */

/**
  * @brief Get a 8-bit unsigned value from specified address
  * @param[in] addr Address to get 8-bit data from
  * @return  8-bit unsigned value stored in specified address
  */
#define M8(addr)  (*((vu8  *) (addr)))

/**
  * @brief Get a 16-bit unsigned value from specified address
  * @param[in] addr Address to get 16-bit data from
  * @return  16-bit unsigned value stored in specified address
  * @note The input address must be 16-bit aligned
  */
#define M16(addr) (*((vu16 *) (addr)))

/**
  * @brief Get a 32-bit unsigned value from specified address
  * @param[in] addr Address to get 32-bit data from
  * @return  32-bit unsigned value stored in specified address
  * @note The input address must be 32-bit aligned
  */
#define M32(addr) (*((vu32 *) (addr)))

/**
  * @brief Set a 32-bit unsigned value to specified I/O port
  * @param[in] port Port address to set 32-bit data
  * @param[in] value Value to write to I/O port
  * @return  None
  * @note The output port must be 32-bit aligned
  */
#define outpw(port,value)     *((volatile unsigned int *)(port)) = value

/**
  * @brief Get a 32-bit unsigned value from specified I/O port
  * @param[in] port Port address to get 32-bit data from
  * @return  32-bit unsigned value stored in specified I/O port
  * @note The input port must be 32-bit aligned
  */
#define inpw(port)            (*((volatile unsigned int *)(port)))

/**
  * @brief Set a 16-bit unsigned value to specified I/O port
  * @param[in] port Port address to set 16-bit data
  * @param[in] value Value to write to I/O port
  * @return  None
  * @note The output port must be 16-bit aligned
  */
#define outps(port,value)     *((volatile unsigned short *)(port)) = value

/**
  * @brief Get a 16-bit unsigned value from specified I/O port
  * @param[in] port Port address to get 16-bit data from
  * @return  16-bit unsigned value stored in specified I/O port
  * @note The input port must be 16-bit aligned
  */
#define inps(port)            (*((volatile unsigned short *)(port)))

/**
  * @brief Set a 8-bit unsigned value to specified I/O port
  * @param[in] port Port address to set 8-bit data
  * @param[in] value Value to write to I/O port
  * @return  None
  */
#define outpb(port,value)     *((volatile unsigned char *)(port)) = value

/**
  * @brief Get a 8-bit unsigned value from specified I/O port
  * @param[in] port Port address to get 8-bit data from
  * @return  8-bit unsigned value stored in specified I/O port
  */
#define inpb(port)            (*((volatile unsigned char *)(port)))

/**
  * @brief Set a 32-bit unsigned value to specified I/O port
  * @param[in] port Port address to set 32-bit data
  * @param[in] value Value to write to I/O port
  * @return  None
  * @note The output port must be 32-bit aligned
  */
#define outp32(port,value)    *((volatile unsigned int *)(port)) = value

/**
  * @brief Get a 32-bit unsigned value from specified I/O port
  * @param[in] port Port address to get 32-bit data from
  * @return  32-bit unsigned value stored in specified I/O port
  * @note The input port must be 32-bit aligned
  */
#define inp32(port)           (*((volatile unsigned int *)(port)))

/**
  * @brief Set a 16-bit unsigned value to specified I/O port
  * @param[in] port Port address to set 16-bit data
  * @param[in] value Value to write to I/O port
  * @return  None
  * @note The output port must be 16-bit aligned
  */
#define outp16(port,value)    *((volatile unsigned short *)(port)) = value

/**
  * @brief Get a 16-bit unsigned value from specified I/O port
  * @param[in] port Port address to get 16-bit data from
  * @return  16-bit unsigned value stored in specified I/O port
  * @note The input port must be 16-bit aligned
  */
#define inp16(port)           (*((volatile unsigned short *)(port)))

/**
  * @brief Set a 8-bit unsigned value to specified I/O port
  * @param[in] port Port address to set 8-bit data
  * @param[in] value Value to write to I/O port
  * @return  None
  */
#define outp8(port,value)     *((volatile unsigned char *)(port)) = value

/**
  * @brief Get a 8-bit unsigned value from specified I/O port
  * @param[in] port Port address to get 8-bit data from
  * @return  8-bit unsigned value stored in specified I/O port
  */
#define inp8(port)            (*((volatile unsigned char *)(port)))

/*@}*/ /* end of group IO_ROUTINE */

/**************************************************************************/
/*                Legacy Constants                                        */
/**************************************************************************/
/** @addtogroup Legacy_Constants Legacy Constants
  NUC990 Legacy Constants
  @{
*/
typedef void *                 PVOID;   /*!< Define void pointer data type              */
typedef void                   VOID;    /*!< Define void data type                      */
typedef char                   BOOL;    /*!< Define bool data type                      */
typedef char *                 PBOOL;   /*!< Define bool pointer data type              */

typedef char                   INT8;    /*!< Define 8-bit singed data type              */
typedef char                   CHAR;    /*!< Define char data type                      */
typedef char *                 PINT8;   /*!< Define 8-bit singed pointer data type      */
typedef char *                 PCHAR;   /*!< Define char pointer data type              */
typedef unsigned char          UINT8;   /*!< Define 8-bit unsigned data type            */
typedef unsigned char          UCHAR;   /*!< Define char unsigned data type             */
typedef unsigned char *        PUINT8;  /*!< Define 8-bit unsigned pointer data type    */
typedef unsigned char *        PUCHAR;  /*!< Define char unsigned pointer data type     */
typedef char *                 PSTR;    /*!< Define string pointer data type            */
typedef const char *           PCSTR;   /*!< Define constant string pointer data type   */

typedef short                  SHORT;   /*!< Define short signed data type              */
typedef short *                PSHORT;  /*!< Define short signed pointer data type      */
typedef unsigned short         USHORT;  /*!< Define short unsigned data type            */
typedef unsigned short *       PUSHORT; /*!< Define short unsigned pointer data type    */

typedef short                  INT16;   /*!< Define 16-bit signed data type             */
typedef short *                PINT16;  /*!< Define 16-bit signed pointer data type     */
typedef unsigned short         UINT16;  /*!< Define 16-bit unsigned data type           */
typedef unsigned short *       PUINT16; /*!< Define 16-bit unsigned pointer data type   */

